content/posts/20210329170852-ruby.md
+++
title = "Ruby"
author = ["Daniel Biasiotto"]
draft = false
+++

## Sources &amp; Cool stuff {#sources-and-cool-stuff}

-   [TheOdinProject](https://www.theodinproject.com/paths/full-stack-ruby-on-rails?)
-   [Ruby Docs](https://ruby-doc.org/)
-   [The Bastards Book of Ruby](http://ruby.bastardsbook.com/chapters)
-   [repl Online Interpreter](https://replit.com/languages/ruby)


## Naming conventions {#naming-conventions}

a_variable


## Variables {#variables}

&gt; [The Bastards Book of Ruby](http://ruby.bastardsbook.com/chapters/variables/)

```ruby
  $global_variables
  @@class_variables
```


## I/O {#i-o}

-   `puts`
    -   inserts a `\n`
-   `print`
-   `gets`
    -   `.chomp` to trim separators


## Conditionals &amp; Flow {#conditionals-and-flow}

The only `false` values are:

-   `nil`
-   `false`

Everything else is `true`
So:

-   "" is `true`
-   0  is `true`

For <span class="underline">boolean evaluation</span> there are classic operators and **the spaceship operator**:

-   `<=>` returns
    -   -1 if the value on the left is less than the value on the right
    -   0 if ... left is equal to ... right
    -   1 if ... left is greater than ... right

Used for sorting.

For <span class="underline">flow control</span> there are:

-   if ... else
-   elifs
-   case ... when ... then
-   unless ... else
-   cond ? if_true : if_false

-   Loops
    &gt; [Article on Skorks About Loops and Iterators](https://skorks.com/2009/09/a-wealth-of-ruby-loops-and-iterators/)
    -   `while`
    -   `for`
    -   `loop`
    -   `until`
    -   `.times`
    -   `.upto`
    -   `.downto`
-   Arrays
    &gt; [docs API](https://ruby-doc.org/core-3.0.0/Array.html)
    &gt; [ZetCode tutorial](https://zetcode.com/lang/rubytutorial/arrays/)

    -   `.last(n)`
    -   `.first(n)`
    -   `.push`
    -   `.pop`
    -   `<<`
        -   shovel operator, like `push`
    -   `.shift`
        -   removes the first element and returns
    -   `.unshift`
        -   add elements at the beginning
    -   `.concat()`
        -   works the same as +, also - can subtract any element from an array

    To get a list of available methods run:

    ```ruby
            num_array.methods
    ```

    -   Hashes
        Similar to JS' objects and Python's dictionaries.
        Hashes are similar to arrays but in place of indexes to access the values stored it uses `keys`.
        Hashes depend solely an keys whereas arrays are highly dependant an order.

        ```ruby
                hash = {
                  "score" => 11,
                  "the array" => [1, 2, 3]
                }

                # Symbol's concise syntax
                hash2 = {
                  symbol1: "hello",
                  symbol2: "world"
                }
                hash2[:symbol1]
                another_hash = Hash.new

                hash["score"] #=> 11
        ```

        Using symbols instead of strings as keys is more efficient and readable.

        -   `.fetch(key, [default value])`
            -   instead of silently returning `nil` it raises an error if the key is not in the hash
        -   `.delete(key)`
            -   also returns the value of the key-value pair
        -   `.merge(second_hash)`